commands_templates/SetVideoSourceMode0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/media/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:SetVideoSourceMode>
         <!--type: ReferenceToken-->
         <wsdl:VideoSourceToken>?</wsdl:VideoSourceToken>
         <!--type: ReferenceToken-->
         <wsdl:VideoSourceModeToken>?</wsdl:VideoSourceModeToken>
      </wsdl:SetVideoSourceMode>
   </soap:Body>
</soap:Envelope>